benchmark/config/development/openrouter-technique.yaml
# 1% development cohort: 2,614 selected cases at the pinned revision.
dataset:
  name: allenai/wildjailbreak
  revision: "5ddc12a7894f842b0619b8e1c7ee496b198af009"
  config_name: train
  split: train
  source: cached
task: adversarial_technique
sample:
  rate: 0.01
  seed: 20260918
adapters:
  - id: openai-luna
    kind: openrouter
    model: openai/gpt-5.6-luna
    cost_reservation_usd: 0.05
execution:
  concurrency: 1
  retries: 0
  timeout_seconds: 30
  # Billed cost normally releases unused reservation after each call.
  cost_cap_usd: 4.00